#pragma once
#include "iSOC_Datatype_Define.h"
#include "iSOC_UnitDefine.h"

#ifdef __cplusplus
extern "C"
{
#endif

/******************************************************************************************************************************
*函数名：iSOC_GetCurrentSystemVolume
*功  能：获取当前系统音量
*参  数：
		 
*返回值：成功返回大于0的值，该值为系统音量，失败返回小于0的值
*备  注：
******************************************************************************************************************************/
iSOC_EXPORT_MODE ISOC_INT iSOC_GetCurrentSystemVolume();

/******************************************************************************************************************************
*函数名：iSOC_SetCurrentSystemVolume
*功  能：设置当前系统音量
*参  数：
		 [IN]	nVolume		音量值，取值范围从0~100
*返回值：成功返回大于0的值，失败返回小于0的值
*备  注：
******************************************************************************************************************************/
iSOC_EXPORT_MODE ISOC_INT iSOC_SetCurrentSystemVolume(IN ISOC_INT nVolume);

/******************************************************************************************************************************
*函数名：iSOC_GetMicroPhoneVolume
*功  能：获取麦克风音量
*参  数：
		 
*返回值：成功返回大于0的值，该值为麦克风音量，失败返回小于0的值
*备  注：
******************************************************************************************************************************/
iSOC_EXPORT_MODE ISOC_INT iSOC_GetMicroPhoneVolume();

/******************************************************************************************************************************
*函数名：iSOC_SetMicroPhoneVolume
*功  能：设置麦克风音量
*参  数：
		 [IN]	nVolume		音量值，取值范围从0~100
*返回值：成功返回大于0的值，失败返回小于0的值
*备  注：
******************************************************************************************************************************/
iSOC_EXPORT_MODE ISOC_INT iSOC_SetMicroPhoneVolume(IN ISOC_INT nVolume);

#ifdef __cplusplus
}
#endif
